/************************************************************************

                          保存实时RTC功能模块
在开机后实时保存RTC时钟至RTC模块提供的备份区，在开机后读取可获得关机赶时间
************************************************************************/
#ifndef __RTC_BAK_H
#define __RTC_BAK_H

/************************************************************************
                           相关函数
************************************************************************/

//---------------------------更新函数-------------------------------
//在更新RTC时后立即调用
void RTC_Bak_Update(void);

//---------------------------获得函数-------------------------------
//在开机更新前调用,返回0表示无效
unsigned long RTC_Bak_Get(void);

/************************************************************************
                         回调函数
************************************************************************/
#include "GlobalFlag.h"

//-----------------------判断是否读取过实时RTC----------------------------
#define RTC_Bak_cbIsFinalRdRTC() GlobalFlag_BitIsSet(0, GF_IS_RD_BAK_RTC)

//-----------------------置为读取过实时RTC----------------------------
#define RTC_Bak_cbSetFinalRdRTC() GlobalFlag_SetBit(0, GF_IS_RD_BAK_RTC)

#endif


